Data Frame - Conditional Selection and Multi Indexing

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
#### creating a data frame

df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [19]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
### operators - conditional selection- comparison operator
df1 = df1>0
print(df1)
print(type(df1))

       W      X      Y      Z
A   True   True   True  False
B  False  False   True   True
C   True   True  False  False
D   True  False  False   True
E   True  False  False   True
<class 'pandas.core.frame.DataFrame'>

In [10]:
booldf = df1>0

#### output will be a boolean data frame

In [11]:
### The above gives a  boolean data Frame
booldf

       W      X      Y      Z
A   True   True   True  False
B  False  False   True   True
C   True   True  False  False
D   True  False  False   True
E   True  False  False   True

In [20]:
#### to get values use bracket notation 

df1[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969       NaN
B       NaN       NaN -0.848077  0.605965
C -2.018168  0.740122       NaN       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794       NaN       NaN  0.683509

In [21]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
#### another way of extracting values using bracket notation 
### note 2 statements have been shrunk to one statement
df1[df1>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
#### to get a subset of values satisfying a particular condition
df1['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [30]:
#### using bracket notation, we can get only the rows where this cond is satisfied
df1[df1['W']>0]

#### remember that the result just ignored the row with C as index. 
### Note that the row 'C' with "NaN" value was left out beecause W > 0 failed there

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df1

In [31]:
#### grab all the rows where Z< 0.6
df1[df1['Z'] < 0.6]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [32]:
### assigning conditional operations on data frame to a variable
resultdf=df1[df1['W']>0] 

print('/n')

### print result set- which itself is a dataframe. meaning i can do other operations on this resultset
print(resultdf)

/n
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
##### extracting data from the above resultset - eg extract column X from result set
df1[df1['W']>0.6][['W','X','Y']]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077

In [37]:
 #### alternate way to extract data from a result set of a conditional op on a data frame
df1[df1['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [28]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 
#### note double bracket notation indicating multiple col extraction

df1[df1['W']>0]  [['X','Y']]  




####

          X         Y
B  0.932131  0.938485
E -0.239359  0.031829

In [50]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 

df1
#### note double bracket notation indicating multiple col extraction

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
##### multiple conditions column extraction

In [55]:
df1[(df1['W']>0) & (df1['Y']>1)] [['W','X','Y','Z']]  

### we get an error that "truth values of series ambiguous"
## and operator can return only single boolean values at a time. but for an entire series of boolean values, it will be confused and so 
### we use the "&"

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [45]:
(df1['W']>0) & (df1['Y']>1)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [17]:
df1[(df1['W']>0) & (df1['Y']>1)]     #### & operator equivalent to and. using and will give an error

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df1[(df1['W']>0) | (df1['Y']>1)]     ##### | operator equivalent to or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [67]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
df1.reset_index()  #### resets index, but not inplace reset

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [69]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df1.reset_index(drop=True,inplace=True) ### will reset the index permanently

In [71]:
 df1

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [64]:
df1.reset_index(drop=True,inplace=True)

In [65]:
df1

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [73]:
#### adding a new column to data frame

In [82]:
newstring = 'CA NY NJ OH CO'

In [88]:
newx = newstring.split()

In [91]:
df1['States'] = newx
df1

          W         X         Y         Z States
0  0.302665  1.693723 -1.706086 -1.159119     CA
1 -0.134841  0.390528  0.166905  0.184502     NY
2  0.807706  0.072960  0.638787  0.329646     NJ
3 -0.497104 -0.754070 -0.943406  0.484752     OH
4 -0.116773  1.901755  0.238127  1.996652     CO

In [92]:
newstring1 = 'CA NY NJ OH'

In [93]:
### step1 - create a new list from a string 
newx1 = newstring1.split()
newx1

['CA', 'NY', 'NJ', 'OH']

In [79]:
df1

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [94]:
###step2 add a column to data frame df1 and call it States
df1['States1'] = newx1
df1

ValueError: Length of values does not match length of index

In [95]:
df1

          W         X         Y         Z States
0  0.302665  1.693723 -1.706086 -1.159119     CA
1 -0.134841  0.390528  0.166905  0.184502     NY
2  0.807706  0.072960  0.638787  0.329646     NJ
3 -0.497104 -0.754070 -0.943406  0.484752     OH
4 -0.116773  1.901755  0.238127  1.996652     CO

In [96]:
#### if we want to make the column States as Index

df1.set_index('States')

#### note the States has become index

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
NJ      0.807706  0.072960  0.638787  0.329646
OH     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [97]:
df1

          W         X         Y         Z States
0  0.302665  1.693723 -1.706086 -1.159119     CA
1 -0.134841  0.390528  0.166905  0.184502     NY
2  0.807706  0.072960  0.638787  0.329646     NJ
3 -0.497104 -0.754070 -0.943406  0.484752     OH
4 -0.116773  1.901755  0.238127  1.996652     CO

In [ ]:
df1

In [ ]:
#### difference between reset and set index is
#### reset index resets to new index and makes the old index as a column in the data frame
#### set index completely overrides the old index
### note both reset and set will become permanent ONLY when using INPLACE argument